In [2]:
import pandas as pd

In [3]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep='\t')

## basic analysis

In [4]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [5]:
def strip_dollar(s) -> str:
    new_s = s.strip('$')
    return float(new_s)
# Turn the item price into a float

In [6]:
chipo['item_price'] = chipo['item_price'].apply(strip_dollar)

In [7]:
chipo

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75

In [8]:
chipo.describe()

          order_id     quantity   item_price
count  4622.000000  4622.000000  4622.000000
mean    927.254868     1.075725     7.464336
std     528.890796     0.410186     4.245557
min       1.000000     1.000000     1.090000
25%     477.250000     1.000000     3.390000
50%     926.000000     1.000000     8.750000
75%    1393.000000     1.000000     9.250000
max    1834.000000    15.000000    44.250000

In [9]:
chipo

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75

In [10]:
chipo.iloc[:9] # See the first 10 entries

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98
6,3,1,Side of Chips,NaN,1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",9.25

In [11]:
len(chipo) # What is the number of observations in the dataset?

4622

In [12]:
chipo.shape # What is the number of columns in the dataset?

(4622, 5)

In [13]:
chipo.columns # Print the name of all the columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [14]:
chipo.index # How is the dataset indexed?

RangeIndex(start=0, stop=4622, step=1)

In [15]:
chipo['item_name'].value_counts().head(1)
# Which was the most ordered item?

Chicken Bowl    726
Name: item_name, dtype: int64

In [16]:
chipo['quantity'].sum() # How many items were ordered?

4972

In [17]:
chipo.groupby('choice_description').sum().sort_values(['quantity'], ascending=False).head(1)
# What was the most ordered item in the choice_description column?

C:\Users\noana\AppData\Local\Temp\ipykernel_35768\2168995321.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  chipo.groupby('choice_description').sum().sort_values(['quantity'], ascending=False).head(1)

                    order_id  quantity  item_price
choice_description
[Diet Coke]           123455       159      326.71

In [18]:
chipo['quantity'].sum() # How many items were orderd in total?

4972

In [19]:
revenue = (chipo['quantity']* chipo['item_price']).sum()
# How much was the revenue for the period in the dataset?

In [20]:
revenue

39237.02

In [21]:
orders = chipo['order_id'].nunique() # nunique - non unique # how many orders were made in the period?

In [22]:
orders

1834

In [23]:
average_amount_per_order = chipo.groupby('order_id').sum().mean()['item_price']
# What is the average amount per order?

C:\Users\noana\AppData\Local\Temp\ipykernel_35768\4084143015.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  average_amount_per_order = chipo.groupby('order_id').sum().mean()['item_price']

In [24]:
average_amount_per_order

18.811428571428568

In [25]:
num_items_sold = chipo.item_name.nunique()
# How many different items are sold?

In [26]:
num_items_sold

50

In [31]:
expensive_items = chipo[chipo['item_price'] > 10.00]
# How many products cost more than $10.00?

In [33]:
len(expensive_items)

1130

In [34]:
item_prices = chipo[['item_name', 'item_price']].drop_duplicates()
# What is the price of each item?

In [35]:
item_prices

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4237                    Chips and Guacamole        8.50
4354                       Steak Soft Tacos       18.50
4489                    Chips and Guacamole       17.80
4509                                  Chips        1.99
4510                          Barbacoa Bowl       11.49

[209 rows x 2 columns]

In [36]:
chipo_sorted = chipo.sort_values(by = 'item_name')
# Sort by the name of the item

In [37]:
chipo_sorted

,order_id,quantity,item_name,choice_description,item_price
3389,1360,2,6 Pack Soft Drink,[Diet Coke],12.98
341,148,1,6 Pack Soft Drink,[Diet Coke],6.49
1849,749,1,6 Pack Soft Drink,[Coke],6.49
1860,754,1,6 Pack Soft Drink,[Diet Coke],6.49
2713,1076,1,6 Pack Soft Drink,[Coke],6.49
...,...,...,...,...,...
2384,948,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75
781,322,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",8.75
2851,1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",8.49
1699,688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25
1395,567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",8.49

In [40]:
orders_by_item = chipo.groupby('item_name').sum()
orders_by_item = orders_by_item.sort_values(by = 'item_price', ascending = False)
# What was the quantity of the most expensive item ordered

C:\Users\noana\AppData\Local\Temp\ipykernel_35768\4072839826.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  orders_by_item = chipo.groupby('item_name').sum()

In [43]:
orders_by_item.iloc[0]['quantity']

761.0

In [44]:
veggie_bowl_orders = chipo[chipo['item_name'] == 'Veggie Salad Bowl']
# How many times were a Veggie Salad Bowl ordered?

In [51]:
len(veggie_bowl_orders)

18

In [56]:
multi_canned_soda_orders = chipo[(chipo['item_name'] == 'Canned Soda') & (chipo['quantity'] > 1)]
# How many times people orderd more than one Canned Soda?

In [57]:
len(multi_canned_soda_orders)

20

In [93]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|', index_col='user_id')

In [94]:
users.head() # Import the necessary librarie

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [95]:
mean_age_by_occupation = users.groupby('occupation').age.mean()
# discover what is the mean age per occupation

In [96]:
mean_age_by_occupation

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [99]:
male_ratio_by_occupation = users.groupby('occupation').apply(male_ratio).sort_values(ascending=False)

#  Discover the Male ratio per occupation and sort it from the most to the least

In [101]:
male_ratio_by_occupation

occupation
administrator    0
marketing        0
technician       0
student          0
scientist        0
salesman         0
retired          0
programmer       0
other            0
none             0
librarian        0
artist           0
lawyer           0
homemaker        0
healthcare       0
executive        0
entertainment    0
engineer         0
educator         0
doctor           0
writer           0
dtype: int64

In [ ]:
# For each occupation, calculate the minimum and maximum ages